partitioned-backwards-facing-step/fluid1/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fixedWalls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }

    cplOutlet
    {
        type            coupledPressure;
        refValue           uniform 0;
        refGradient         uniform 0;
        valueFraction       uniform 1;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
